liebman/esp32-gps-ntp/sdkconfig.defaults
#
# Text Settings
#
CONFIG_LVGL_TXT_ENC_UTF8=y
# CONFIG_LVGL_TXT_ENC_ASCII is not set
CONFIG_LVGL_TXT_BREAK_CHARS=" ,.;:-_"
CONFIG_LVGL_TXT_LINE_BREAK_LONG_LEN=0
CONFIG_LVGL_TXT_LINE_BREAK_LONG_PRE_MIN_LEN=3
CONFIG_LVGL_TXT_LINE_BREAK_LONG_POST_MIN_LEN=3
CONFIG_LVGL_TXT_COLOR_CMD="#"
CONFIG_LVGL_BIDI_NO_SUPPORT=y
# CONFIG_LVGL_BIDI_DIR_LTR is not set
# CONFIG_LVGL_BIDI_DIR_RTL is not set
# CONFIG_LVGL_BIDI_DIR_AUTO is not set
# CONFIG_LVGL_USE_ARABIC_PERSIAN_CHARS is not set
# CONFIG_LVGL_SPRINTF_CUSTOM is not set
# CONFIG_LVGL_SPRINTF_DISABLE_FLOAT is not set
# end of Text Settings

#
# Widgets
#
CONFIG_LVGL_USE_OBJ_REALIGN=y
# CONFIG_LVGL_EXT_CLICK_AREA_OFF is not set
CONFIG_LVGL_EXT_CLICK_AREA_TINY=y
# CONFIG_LVGL_EXT_CLICK_AREA_FULL is not set
CONFIG_LVGL_WIDGETS_USE_ARC=y
CONFIG_LVGL_WIDGETS_USE_BAR=y
CONFIG_LVGL_WIDGETS_USE_BTN=y
CONFIG_LVGL_WIDGETS_USE_BTNMATRIX=y
CONFIG_LVGL_WIDGETS_USE_CALENDAR=y
CONFIG_LVGL_WIDGETS_USE_CANVAS=y
CONFIG_LVGL_WIDGETS_USE_CHECKBOX=y
CONFIG_LVGL_WIDGETS_USE_CHART=y
CONFIG_LVGL_WIDGETS_CHART_AXIS_MAX_LEN=256
CONFIG_LVGL_WIDGETS_USE_CONTAINER=y
CONFIG_LVGL_WIDGETS_USE_CPICKER=y
CONFIG_LVGL_WIDGETS_USE_DROPDOWN=y
CONFIG_LVGL_WIDGETS_USE_GAUGE=y
CONFIG_LVGL_WIDGETS_USE_IMG=y
CONFIG_LVGL_WIDGETS_USE_IMGBTN=y
CONFIG_LVGL_WIDGETS_USE_KEYBOARD=y
CONFIG_LVGL_WIDGETS_USE_LABEL=y
CONFIG_LVGL_WIDGETS_LABEL_DEF_SCROLL_SPEED=25
CONFIG_LVGL_WIDGETS_LABEL_WAIT_CHAR_COUNT=3
CONFIG_LVGL_WIDGETS_USE_LED=y
CONFIG_LVGL_WIDGETS_LED_BRIGHT_MIN=120
CONFIG_LVGL_WIDGETS_LED_BRIGHT_MAX=255
CONFIG_LVGL_WIDGETS_USE_LINE=y
CONFIG_LVGL_WIDGETS_USE_LIST=y
CONFIG_LVGL_WIDGETS_LIST_DEFAULT_ANIMATION_TIME=100
CONFIG_LVGL_WIDGETS_USE_LINEMETER=y
CONFIG_LVGL_WIDGETS_USE_OBJMASK=y
CONFIG_LVGL_WIDGETS_USE_MSGBOX=y
CONFIG_LVGL_WIDGETS_USE_PAGE=y
CONFIG_LVGL_WIDGETS_PAGE_ANIMATION_DEFAULT_TIME=100
CONFIG_LVGL_WIDGETS_USE_SPINNER=y
CONFIG_LVGL_WIDGETS_SPINNER_DEF_ARC_LENGTH=60
CONFIG_LVGL_WIDGETS_SPINNER_DEF_SPIN_TIME=1000
CONFIG_LVGL_WIDGETS_USE_ROLLER=y
CONFIG_LVGL_WIDGETS_ROLLER_DEF_ANIM_TIME=200
CONFIG_LVGL_WIDGETS_ROLLER_INF_PAGES=7
CONFIG_LVGL_WIDGETS_USE_SLIDER=y
CONFIG_LVGL_WIDGETS_USE_SPINBOX=y
CONFIG_LVGL_WIDGETS_USE_SWITCH=y
CONFIG_LVGL_WIDGETS_USE_TEXTAREA=y
CONFIG_LVGL_WIDGETS_TEXTAREA_DEF_CURSOR_BLINK_TIME=400
CONFIG_LVGL_WIDGETS_TEXTAREA_DEF_PWN_SHOW_TIME=1500
CONFIG_LVGL_WIDGETS_USE_TABLE=y
CONFIG_LVGL_WIDGETS_TABLE_COL_MAX=12
CONFIG_LVGL_WIDGETS_USE_TABVIEW=y
CONFIG_LVGL_WIDGETS_TABVIEW_SLIDE_ANIMATION=300
CONFIG_LVGL_WIDGETS_USE_TILEVIEW=y
CONFIG_LVGL_WIDGETS_TILEVIEW_SLIDE_ANIMATION=300
CONFIG_LVGL_WIDGETS_USE_WINDOW=y
# end of Widgets

#
# Indev device settings
#
CONFIG_LVGL_INDEV_DEF_READ_PERIOD=30
CONFIG_LVGL_INDEV_DEF_DRAG_LIMIT=10
CONFIG_LVGL_INDEV_DEF_DRAG_THROW=10
CONFIG_LVGL_INDEV_DEF_LONG_PRESS_TIME=400
CONFIG_LVGL_INDEV_DEF_LONG_PRESS_REP_TIME=100
CONFIG_LVGL_INDEV_DEF_GESTURE_LIMIT=50
CONFIG_LVGL_INDEV_DEF_GESTURE_MIN_VELOCITY=3
# end of Indev device settings

#
# Feature usage
#
CONFIG_LVGL_FEATURE_USE_ANIMATION=y
CONFIG_LVGL_FEATURE_USE_SHADOW=y
CONFIG_LVGL_SHADOW_CACHE_SIZE=0
CONFIG_LVGL_FEATURE_USE_BLEND_MODES=y
CONFIG_LVGL_FEATURE_USE_OPA_SCALE=y
CONFIG_LVGL_FEATURE_USE_IMG_TRANSFORM=y
CONFIG_LVGL_FEATURE_USE_GROUP=y
CONFIG_LVGL_FEATURE_USE_GPU=y
# CONFIG_LVGL_FEATURE_USE_GPU_STM32_DMA2D is not set
CONFIG_LVGL_FEATURE_USE_FILESYSTEM=y
CONFIG_LVGL_FEATURE_USE_USER_DATA=y
# CONFIG_LVGL_FEATURE_USE_PERF_MONITOR is not set
CONFIG_LVGL_FEATURE_USE_API_EXTENSION_V6=y
# end of Feature usage

#
# Image decoder and cache
#
CONFIG_LVGL_IMG_CF_INDEXED=y
CONFIG_LVGL_IMG_CF_ALPHA=y
CONFIG_LVGL_IMG_CACHE_DEF_SIZE=1
# end of Image decoder and cache
# end of LVGL configuration

#
# LVGL TFT Display controller
#
CONFIG_LVGL_PREDEFINED_DISPLAY_NONE=y
# CONFIG_LVGL_PREDEFINED_DISPLAY_WROVER4 is not set
# CONFIG_LVGL_PREDEFINED_DISPLAY_M5STACK is not set
# CONFIG_LVGL_PREDEFINED_DISPLAY_M5STICK is not set
# CONFIG_LVGL_PREDEFINED_DISPLAY_M5STICKC is not set
# CONFIG_LVGL_PREDEFINED_DISPLAY_ERTFT0356 is not set
# CONFIG_LVGL_PREDEFINED_DISPLAY_ADA_FEATHERWING is not set
# CONFIG_LVGL_PREDEFINED_DISPLAY_RPI_MPI3501 is not set
# CONFIG_LVGL_PREDEFINED_DISPLAY_WEMOS_LOLIN is not set
# CONFIG_LVGL_PREDEFINED_DISPLAY_ATAG is not set
# CONFIG_LVGL_PREDEFINED_DISPLAY_RPI_RA8875 is not set
# CONFIG_LVGL_PREDEFINED_DISPLAY_TTGO is not set
# CONFIG_LVGL_PREDEFINED_DISPLAY_TTGO_CAMERA_PLUS is not set
CONFIG_LVGL_TFT_DISPLAY_CONTROLLER_ILI9341=y
CONFIG_LVGL_TFT_DISPLAY_PROTOCOL_SPI=y
CONFIG_LVGL_PREDEFINED_PINS_NONE=y
# CONFIG_LVGL_PREDEFINED_PINS_38V4 is not set
# CONFIG_LVGL_PREDEFINED_PINS_30 is not set
# CONFIG_LVGL_PREDEFINED_PINS_38V1 is not set
# CONFIG_LVGL_PREDEFINED_PINS_TKOALA is not set
CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_ILI9341=y
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_ILI9481 is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_ILI9486 is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_ILI9488 is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_ST7789 is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_GC9A01 is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_ST7735S is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_HX8357 is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_SH1107 is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_SSD1306 is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_FT81X is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_IL3820 is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_JD79653A is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_UC8151D is not set
# CONFIG_LVGL_TFT_DISPLAY_USER_CONTROLLER_RA8875 is not set
# CONFIG_LVGL_TFT_DISPLAY_SPI_HSPI is not set
CONFIG_LVGL_TFT_DISPLAY_SPI_VSPI=y
# CONFIG_LVGL_DISPLAY_ORIENTATION_PORTRAIT is not set
# CONFIG_LVGL_DISPLAY_ORIENTATION_PORTRAIT_INVERTED is not set
# CONFIG_LVGL_DISPLAY_ORIENTATION_LANDSCAPE is not set
CONFIG_LVGL_DISPLAY_ORIENTATION_LANDSCAPE_INVERTED=y
CONFIG_LVGL_DISPLAY_ORIENTATION=3
CONFIG_LVGL_DISPLAY_WIDTH=320
CONFIG_LVGL_DISPLAY_HEIGHT=240
# CONFIG_LVGL_TFT_USE_CUSTOM_SPI_CLK_DIVIDER is not set
CONFIG_LVGL_TFT_CUSTOM_SPI_CLK_DIVIDER=2
# CONFIG_LVGL_INVERT_DISPLAY is not set
# CONFIG_LVGL_INVERT_COLORS is not set
CONFIG_LVGL_AXP192_PIN_SDA=21
CONFIG_LVGL_AXP192_PIN_SCL=22

#
# Display Pin Assignments
#
CONFIG_LVGL_DISP_SPI_MOSI=23
CONFIG_LVGL_DISPLAY_USE_SPI_MISO=y
CONFIG_LVGL_DISP_SPI_MISO=19
CONFIG_LVGL_DISP_SPI_INPUT_DELAY_NS=0
CONFIG_LVGL_DISP_SPI_CLK=18
CONFIG_LVGL_DISPLAY_USE_SPI_CS=y
CONFIG_LVGL_DISP_SPI_CS=5
CONFIG_LVGL_DISPLAY_USE_DC=y
CONFIG_LVGL_DISP_PIN_DC=21
CONFIG_LVGL_DISP_PIN_RST=22
CONFIG_LVGL_DISP_PIN_BUSY=35
# CONFIG_LVGL_ENABLE_BACKLIGHT_CONTROL is not set
CONFIG_LVGL_DISP_PIN_SDA=5
CONFIG_LVGL_DISP_PIN_SCL=4
# end of Display Pin Assignments
# end of LVGL TFT Display controller

#
# LVGL Touch controller
#
CONFIG_LVGL_TOUCH_CONTROLLER=1
# CONFIG_LVGL_TOUCH_CONTROLLER_NONE is not set
CONFIG_LVGL_TOUCH_CONTROLLER_XPT2046=y
# CONFIG_LVGL_TOUCH_CONTROLLER_FT6X06 is not set
# CONFIG_LVGL_TOUCH_CONTROLLER_STMPE610 is not set
# CONFIG_LVGL_TOUCH_CONTROLLER_ADCRAW is not set
# CONFIG_LVGL_TOUCH_CONTROLLER_FT81X is not set
# CONFIG_LVGL_TOUCH_CONTROLLER_RA8875 is not set
CONFIG_LVGL_TOUCH_DRIVER_PROTOCOL_SPI=y
# CONFIG_LVGL_TOUCH_CONTROLLER_SPI_HSPI is not set
CONFIG_LVGL_TOUCH_CONTROLLER_SPI_VSPI=y

#
# Touchpanel (XPT2046) Pin Assignments
#
CONFIG_LVGL_TOUCH_SPI_MISO=19
CONFIG_LVGL_TOUCH_SPI_MOSI=23
CONFIG_LVGL_TOUCH_SPI_CLK=18
CONFIG_LVGL_TOUCH_SPI_CS=25
CONFIG_LVGL_TOUCH_PIN_IRQ=36
# end of Touchpanel (XPT2046) Pin Assignments

#
# Touchpanel Configuration (XPT2046)
#
CONFIG_LVGL_TOUCH_X_MIN=200
CONFIG_LVGL_TOUCH_Y_MIN=120
CONFIG_LVGL_TOUCH_X_MAX=1900
CONFIG_LVGL_TOUCH_Y_MAX=1900
# CONFIG_LVGL_TOUCH_XY_SWAP is not set
# CONFIG_LVGL_TOUCH_INVERT_X is not set
# CONFIG_LVGL_TOUCH_INVERT_Y is not set
# end of Touchpanel Configuration (XPT2046)
# end of LVGL Touch controller
# end of Component config

#
# Compatibility options
#
# CONFIG_LEGACY_INCLUDE_COMMON_HEADERS is not set
# end of Compatibility options
